'''
Задание 1
Пользователь вводит с клавиатуры три числа. Необхо-
димо найти сумму чисел, произведение чисел. Результат
вычислений вывести на экран.



print("Добрый день. Это домашняя работа по курсу Python,\nвыполненная студентом группы Python23 академии ТОР, Челябинск\n"
	  "Щур Александром Николаевичем.\nПреподаватель Андрей Комаров\n"
	  "________________________________________________________________________________________________________________")

a = float(input("Введите первое число (цифрой): "))
b = float(input("Введите второе число (цифрой): "))
c = float(input("Введите третье число (цифрой): "))
summa = a + b + c
mult = a * b * c
print(f"Сумма введенных чисел равна {summa}. Произведение введенных чисел равно {mult}.")


print("________________________________________________________________________________________________________________\n"
	  "Благодарю вас за пользование моей программой.\n"
      "Направляйте свои замечания на электронную почту alexandershchoor@gmail.com.\n"
      "Спасибо за внимание.")


Задание 2
Пользователь вводит с клавиатуры три числа. Первое
число — зарплата за месяц, второе число — сумма месяч-
ного платежа по кредиту в банке, третье число — задол-
женность за коммунальные услуги. Необходимо вывести
на экран сумму, которая останется у пользователя после
всех выплат.


print("Добрый день. Это домашняя работа по курсу Python,\nвыполненная студентом группы Python23 академии ТОР, Челябинск\n"
	  "Щур Александром Николаевичем.\nПреподаватель Андрей Комаров\n"
	  "________________________________________________________________________________________________________________")

a = float(input("Введите зарплату (цифрой): "))
b = float(input("Введите платеж по кредиту (цифрой): "))
c = float(input("Введите платеж за ЖКХ (цифрой): "))
result = a - b - c

print(f"После обязательных платежей у Вас останется {result} рублей.")


print("________________________________________________________________________________________________________________\n"
	  "Благодарю вас за пользование моей программой.\n"
      "Направляйте свои замечания на электронную почту alexandershchoor@gmail.com.\n"
      "Спасибо за внимание.")

Задание 3
Напишите программу, вычисляющую площадь ром-
ба. Пользователь с клавиатуры вводит длину двух его
диагоналей.


print("Добрый день. Это домашняя работа по курсу Python,\nвыполненная студентом группы Python23 академии ТОР, Челябинск\n"
	  "Щур Александром Николаевичем.\nПреподаватель Андрей Комаров\n"
	  "________________________________________________________________________________________________________________")

a = float(input("Введите длину первой диагонали ромба (цифрой): "))
b = float(input("Введите длину второй диагонали ромба (цифрой): "))

area = a * b / 2

print(f"Площадь ромба с указанными диагоналями равна {area}.")


print("________________________________________________________________________________________________________________\n"
	  "Благодарю вас за пользование моей программой.\n"
      "Направляйте свои замечания на электронную почту alexandershchoor@gmail.com.\n"
      "Спасибо за внимание.")



Задание 4
Выведите на экран надпись To be or not to be на разных
строках.

print("Добрый день. Это домашняя работа по курсу Python,\nвыполненная студентом группы Python23 академии ТОР, Челябинск\n"
	  "Щур Александром Николаевичем.\nПреподаватель Андрей Комаров\n"
	  "________________________________________________________________________________________________________________")


print("To be,\n"
	  "   or not\n"
	  "        to be")


print("________________________________________________________________________________________________________________\n"
	  "Благодарю вас за пользование моей программой.\n"
      "Направляйте свои замечания на электронную почту alexandershchoor@gmail.com.\n"
      "Спасибо за внимание.")


Задание 5
Выведите на экран надпись «Life is what happens when
you're busy making other plans» John Lennon на разных
строках.


print("Добрый день. Это домашняя работа по курсу Python,\nвыполненная студентом группы Python23 академии ТОР, Челябинск\n"
	  "Щур Александром Николаевичем.\nПреподаватель Андрей Комаров\n"
	  "________________________________________________________________________________________________________________")


print("\"Life is what\n"
	  "   happens when you are\n"
	  "           busy making other plans\"\n"
	  "             John Lennon")

print("________________________________________________________________________________________________________________\n"
	  "Благодарю вас за пользование моей программой.\n"
      "Направляйте свои замечания на электронную почту alexandershchoor@gmail.com.\n"
      "Спасибо за внимание.")
'''
